Repository: autohotkey-docs-translation/v1-pt-br
Catalog: omegat/project_save.tmx
Source language: en
Languages: pt_br

source: Be patient.
pt_br: Seja paciente.

source: Be polite.
pt_br: Seja educado.

source: Be sure to save the file as UTF-8 with BOM if it will contain non-ASCII characters.
pt_br: Certifique-se de salvar o arquivo como UTF-8 com BOM se ele conterá caracteres que não sejam ASCII.

source: Because UIA programs run at a different "integrity level" than other programs, they can only access objects registered by other UIA programs.
pt_br: Tendo em vista que programas UIA executam em um “nível de integridade” diferente de outros programas, eles só podem acessar objetos registrados por outros programas UIA.

source: Because a variable only ever contains a reference to an object and not the object itself, when you pass such a variable to a non-ByRef parameter, what the function receives is a reference to the same object.
pt_br: Como uma variável somente contém, a qualquer momento, uma referência para um objeto e não o objeto em si, quando você passar uma variável dessa para um parâmetro que não seja ByRef, o que a função recebe é uma referência ao mesmo objeto.

source: Before AutoHotkey can do anything, you need to write a script telling it what to do.
pt_br: Antes que o AutoHotkey possa fazer qualquer coisa, você precisa escrever um script dizendo ao AHK o que fazer.

source: Before learning to use AutoHotkey (AHK), you will need to download it.
pt_br: Antes de aprender a usar o AutoHotkey (AHK), você precisa baixá-lo.

source: Before we begin our journey, let me give some advice.
pt_br: Antes de começarmos nossa jornada, deixe-me te dar um conselho.

source: Before you ask, try doing some research yourself or try to code it yourself.
pt_br: Antes de perguntar, tente pesquisar um pouco por conta própria ou tente escrever o código você mesmo.

source: Beginner Tutorial | AutoHotkey
pt_br: Tutorial para iniciantes | AutoHotkey

source: Behaviour depends on the audio drivers, which are necessarily different to the ones used on XP.
pt_br: O comportamento depende de drivers de áudio, que são necessariamente diferente daqueles usados no Windows XP.

source: Below are several such words/phrases which are used frequently in relation to functions and commands:
pt_br: Abaixo há várias palavras/expressões que são usadas frequentemente em relação a funções e comandos:

source: Blanking the value out
pt_br: Método da substituição por “em branco”

source: Blind mode
pt_br: Modo Cego

source: Body
pt_br: Corpo

source: Boolean
pt_br: Valores Booleanos

source: Boolean values are used to represent anything that has exactly two possible states, such as the truth of an expression.
pt_br: Valores booleanos são usados para representar qualquer coisa que tenha exatamente dois estados possíveis, como a verdade de uma expressão.

source: Both variables might exist at the same time, but only one is visible to each part of the script.
pt_br: Ambas as variáveis podem existir ao mesmo tempo, mas somente uma estará visível a cada parte do script.

source: Brace syntax
pt_br: Sintaxe de chaves

source: Bracket notation
pt_br: Notação de colchetes

source: Bracket syntax
pt_br: Sintaxe de colchetes

source: Built-in Variables
pt_br: Variáveis Nativas

source: But before we get into things, we should talk about some common issues that people have.
pt_br: Mas antes de começar, temos que falar de alguns problemas por que as pessoas costumam passar.

source: But before we go, here are some other things that I think you should know.
pt_br: Mas antes de irmos embora, aqui estão mais algumas coisinhas que eu acho que você deveria saber.

source: But don't be afraid to ask for help, we don't bite (hard).
pt_br: Mas não se acanhe em pedir ajuda, nós não mordemos (forte).

source: But first, you need to find the script file.
pt_br: Mas antes, você deve encontrar o arquivo do script.

source: But in fact they are needed.
pt_br: Mas elas são necessárias.

source: But in some cases you might want to specify criteria such as HWND, group or class.
pt_br: Mas, em alguns casos, você pode querer especificar algum critério como HWND, grupo ou classe.

source: But now you are wondering "How can I make my really long Send commands readable?".
pt_br: Agora você deve estar se perguntando: “Como eu faço meu comando Send, que ficou bem longo, mais legível?”.

source: But that depends on the version you want.
pt_br: mas isso dependerá da versão que você quer.

source: But there are some alternatives, try all the solutions mentioned below.
pt_br: Mas há algumas alternativas; tente todas as soluções abaixo.

source: But what if we want to type into an existing Notepad window?
pt_br: Mas e se quisermos digitar sobre uma janela já existente do Bloco de Notas?

source: But you are now wondering if hotstrings have any cool modifiers since hotkeys do.
pt_br: Mas agora você está se perguntando se as hotstrings têm modificadores maneiros iguais aos das hotkeys.

source: ButtonSubmit:
pt_br: ButtonEnviar:

source: By convention in AutoHotkey, the first character is at position 1.
pt_br: No AutoHotkey, por convenção, o primeiro caractere está na posição 1.

source: By convention, most of these variables start with the prefix A_, so it is best to avoid using this prefix for your own variables.
pt_br: Por convenção, a maioria dessas variáveis inicia com o prefixo A_, então é melhor evitar usar esse prefixo nas variáveis que você criar.

source: By default (that is, if neither SendRaw nor the Raw mode or Text mode is used), the characters ^+!#{} have a special meaning.
pt_br: Por padrão (isto é, se nem o comando SendRaw nem o modo Bruto ou modo textual são usados), os caracteres ^+!#{} têm um significado especial.

source: By default this will open Notepad, but that can be changed by writing to the registry as shown here.
pt_br: Por padrão isso abrirá o Bloco de Notas, mas você pode mudar o editor de texto inserindo mudanças no registro como mostrado aqui.

source: By default, UAC protects "elevated" programs (that is, programs which are running as admin) from being automated by non-elevated programs, since that would allow them to bypass security restrictions.
pt_br: Por padrão, o UAC protege programas “elevados” (isto é, programas que estão sendo executados como administrador) de serem automatizados por programas não elevados, já que isso permitiria contornar restrições de segurança.

source: By default, double-clicking the tray icon shows the script's main window.
pt_br: Por padrão, clicar com o botão direito no ícone da bandeja mostra a janela principal do script.

source: By default, each script adds its own icon to the taskbar notification area (commonly known as the tray).
pt_br: Por padrão, cada script adiciona seu próprio ícone à área de notificação da barra de tarefas (comumente chamada de “bandeja”).

source: By default, the installer will enable the option if UAC is enabled and the UI Access context menu option was present before installation.
pt_br: Por padrão, o instalador habilitará a opção se o UAC estiver habilitado e a opção UI Access do menu contexto estava presente antes da instalação.

source: By default, variables are passed to user-defined functions by value.
pt_br: Por padrão, variáveis são passadas para funções definidas pelo usuário por valor.

source: COM objects.
pt_br: Objetos COM.

source: Call AutoHotkey.exe on the command line and pass the script's filename as a command-line parameter.
pt_br: Execute AutoHotkey.exe na linha de comando e passe o nome do arquivo do script como um parâmetro da linha de comando.

source: Call a function or command
pt_br: Chamar uma função ou comando

source: Callouts","misc/RegExCallout.htm"],
pt_br: Chamadas","misc/RegExCallout.htm"],

source: Can I draw something with AHK?
pt_br: Como eu desenho alguma coisa com o AHK?

source: Can I find my script somewhere else?
pt_br: Posso encontrar meu script em algum outro lugar?

source: Can I run AHK from a USB drive?
pt_br: Posso rodar o AHK a partir de um pendrive?

source: Can I use wildcards or regular expressions in Hotstrings?
pt_br: Posso usar caracteres curinga ou expressões regulares em Hotstrings?

source: CapsLock and IME
pt_br: CapsLock e Editores de Método de Entrada (IME)

source: Carry out, perform, evaluate, put into effect, etc. Execute basically has the same meaning as in non-programming speak.
pt_br: Fazer, executar, exercer, calcular, avaliar, pôr em efeito, etc. Executar tem basicamente o mesmo significado que tem fora do jargão da programação.

source: Certain restrictions apply to variable names - see Names for details.
pt_br: Algumas restrições se aplicam a nomes - vide Nomes para detalhes.

source: Choose what you like or learn to indent how you think it's easiest to read.
pt_br: Escolha aquele estilo que você gostou ou aprenda a indentar daquele jeito que você acha que é mais fácil de ler.

source: Click "AutoHotkey Script" inside the "New" menu.
pt_br: Clique em “AutoHotkey Script” dentro do menu “Novo”.

source: Click "Edit Script".
pt_br: Clique em “Edit Script”.

source: Click Programs or All Programs.
pt_br: Clique em Programas ou Todos os programas.

source: Click Download:
pt_br: Clique em Download:

source: Click it.
pt_br: Clique nele.

source: Closing this window with WinClose (even from another script) causes the script to exit, but most other methods just hide the window and leave the script running.
pt_br: Fechar esta janela com WinClose (mesmo a partir de outro script) causa que o script seja finalizado, mas a maioria dos outros métodos apenas ocultam a janela e deixam o script rodando.

source: Code blocks
pt_br: Blocos de código

source: Color theme:
pt_br: Cor do tema:

source: Colors might turn out black (0x000000) no matter the color you try to get.
pt_br: As cores podem virar preto (0x000000) independentemente da cor que você estiver tentando obter.

source: Command Line Usage
pt_br: Uso da Linha de Comando

source: Command and function list
pt_br: Lista de comandos e funções

source: Command, Parameter1, Parameter2, Parameter3
pt_br: Comando, Parametro1, Parametro2, Parametro3

source: Commands
pt_br: Comandos

source: Commands also differ from function in that they use "legacy syntax".
pt_br: Comandos também se diferenciam das funções na medida em que aqueles usam a “sintaxe legada”.

source: Commands and functions can have many different purposes.
pt_br: Comandos e funções podem ter propósitos diferentes.

source: Commands and functions.
pt_br: comandos e funções.

source: Commands do not return a result directly; instead, they store the result in a variable.
pt_br: Comandos não retornam um valor diretamente; em vez disso, eles armazenam o resultado em uma variável.

source: Commands do not use parentheses around the parameters like functions do.
pt_br: Comandos não usam parênteses em volta dos parâmetros como as funções.

source: Commands need an OutputVar parameter, functions do not.
pt_br: Comandos requerem um parâmetro OutputVar (variável de saída); funções dispensam.

source: Commands vs. Functions()
pt_br: Comandos x funções()

source: Common Tasks
pt_br: Tarefas comuns

source: Common abbreviations include param and arg.
pt_br: Abreviaturas comuns são param e arg.

source: Common workarounds are as follows:
pt_br: Soluções de contorno comuns são as seguintes:

source: Compile Script (depending on the Install script compiler installation option)
pt_br: Compile Script (Compilar Script, dependendo da opção Install script compiler

source: Concepts and Conventions
pt_br: Conceitos e Convenções

source: Concepts and Conventions | AutoHotkey
pt_br: Conceitos e Convenções | AutoHotkey

source: Consider the following example, which makes Numpad0 into a prefix key:
pt_br: Considere o exemplo seguinte, em que a tecla Numpad0 é feita de tecla de prefixo:

source: Consider this revised set of instructions:
pt_br: Considere este conjunto revisado de instruções:

source: Content (default)
pt_br: Conteúdo (padrão)

source: Content font size:
pt_br: Tamanho da fonte do conteúdo:

source: Continue on to section b.
pt_br: Continue para a seção b.

source: Control (or Ctrl)
pt_br: Control (ou Ctrl)

source: Control Flow
pt_br: Fluxo de Controle

source: ControlGetText, OutputVar
pt_br: ControlGetText, VarDeSaida

source: ControlGetText, OutputVar, Control, ExcludeTitle
pt_br: ControlGetText, VarDeSaida, Controle, TituloExcluido

source: ControlGetText, OutputVar, Control, WinTitle
pt_br: ControlGetText, VarDeSaida, Controle, TituloJanela

source: ControlGetText, OutputVar, Control,,, ExcludeTitle
pt_br: ControlGetText, VarDeSaida, Controle,,, TituloExcluido

source: ControlSend,, abc, game_title
pt_br: ControlSend,, abc, titulo_do_jogo

source: Copies AutoHotkeyA32.exe, AutoHotkeyU32.exe and (if present) AutoHotkeyU64.exe to AutoHotkey*_UIA.exe.
pt_br: Copia os executáveis AutoHotkeyA32.exe, AutoHotkeyU32.exe e (se presente) AutoHotkeyU64.exe para AutoHotkey*_UIA.exe.

source: Copying that variable, as in yourObj := myObj, creates a new reference to the same object.
pt_br: Copiar aquela variável, como em seuObjeto := meuObjeto, cria uma nova referência ao mesmo objeto.

source: Corresponds to the <! hotkey prefix.
pt_br: Corresponde ao prefixo <! das hotkeys.

source: Corresponds to the <# hotkey prefix.
pt_br: Corresponde ao prefixo <#.

source: Corresponds to the <+ hotkey prefix.
pt_br: Corresponde ao prefixo <+ das hotkeys.

source: Corresponds to the <^ hotkey prefix.
pt_br: Corresponde ao prefixo <^ das hotkeys.

source: Corresponds to the >! hotkey prefix.
pt_br: Corresponde ao prefixo >! das hotkeys.

source: Corresponds to the ># hotkey prefix.
pt_br: Corresponde ao prefixo >#.

source: Corresponds to the >+ hotkey prefix.
pt_br: Corresponde ao prefixo >+ das hotkeys.

source: Corresponds to the >^ hotkey prefix.
pt_br: Corresponde ao prefixo >^ das hotkeys.

source: Corresponds to the ! hotkey prefix.
pt_br: Corresponde ao prefixo ! das hotkeys.

source: Corresponds to the + hotkey prefix.
pt_br: Corresponde ao prefixo + das hotkeys.

source: Corresponds to the ^ hotkey prefix.
pt_br: Corresponde ao prefixo ^ das hotkeys.

source: Create a Script
pt_br: Criar um script

source: Creates a self-signed digital certificate named "AutoHotkey" and signs each UIA file.
pt_br: Cria um certificado digital autoassinado nomeado “AutoHotkey” e assina cada arquivo UIA.

source: Creating Objects
pt_br: Criando objetos

source: Currently there is also a "hybrid" syntax allowed with Set, but it is best not to use it:
pt_br: Também existe uma sintaxe “híbrida” permitida para a instrução Set, mas é melhor não a usar:

source: Cursor Control Keys
pt_br: Teclas de Controle do Cursor

source: Dark
pt_br: Escura

source: Decimal floating-point numbers, such as 3.14159.
pt_br: Números decimais de ponto flutuante, como 3.14159.

source: Decimal integers, such as 123, 00123 or -1.
pt_br: Inteiros decimais, como 123, 00123 ou -1.

source: Delete (or Del)
pt_br: Delete (ou Del)

source: Delete method
pt_br: Método da deleção

source: Depending on the condition, control flows one of two ways:
pt_br: Dependendo da condição, o controle flui de uma dessas duas maneiras:

source: Description
pt_br: Descrição

source: Details
pt_br: Detalhes

source: Disable UAC completely.
pt_br: Desabilite o UAC completamente.

source: Disable or remove any extra software that came with your keyboard or mouse or change its driver to a more standard one such as the one built into the OS.
pt_br: desabilite ou remova qualquer software extra que tenha vindo com seu teclado ou mouse ou altere seu driver para um mais padronizado, como aquele nativo do sistema operacional.

source: Disable the local security policy "Run all administrators in Admin Approval Mode" (not recommended).
pt_br: Desabilite a política de segurança "Executar todos os administradores em Modo de Aprovação do Administrador" (não recomendado).

source: Does it really contain a virus?
pt_br: Ele contém mesmo um vírus?

source: Don't be afraid to ask for help, even the smartest people ask others for help.
pt_br: Não tenha medo de pedir ajuda; mesmo as pessoas mais sábias pedem ajuda.

source: Don't be afraid to show what you tried, even if you think it's silly.
pt_br: Não tenha medo de mostrar o que você já tentou, mesmo que você pense que ficou bobo.

source: Done!
pt_br: Pronto!

source: Dot notation
pt_br: Notação de ponto

source: Double quotes (") have special meaning only within expressions.
pt_br: Aspas duplas (") têm significado especial somente quando estão dentro de expressões.

source: Double-click a script file (or shortcut to a script file) in Explorer.
pt_br: Dê um clique duplo num arquivo de script (ou atalho para um arquivo de script) no Explorador de Arquivos.

source: Double-click that script's tray icon to open its main window.
pt_br: Dê um duplo click no ícone do script na área de notificação para abrir sua janela principal.

source: Double-click the file/icon in the desktop to run it.
pt_br: Dê um duplo clique no arquivo/ícone na área de trabalho para executá-lo.

source: Downloading and installing AutoHotkey
pt_br: Baixando e instalando o AutoHotkey

source: Due to style conventions, it is generally better to name your variables using only letters, numbers, and the underscore character (for example:
pt_br: Devido a convenções de estilo, é geralmente melhor nomear suas variáveis usando somente letras, números e o caractere _ (por exemplo:)

source: Due to system behavior, the following keys separated by a slash are identified differently depending on whether NumLock is ON or OFF.
pt_br: Devido ao comportamento do sistema, as teclas separadas por uma barra a seguir são identificadas de forma diferente a depender do estado da tecla NumLock, se LIGADA ou DESLIGADA.

source: During installation of AutoHotkey, you will be asked to choose from UNICODE or ANSI.
pt_br: Durante a instalação do AutoHotkey, você será perguntado se quer usar a codificação UNICODE ou ANSI.

source: E:\My AutoHotkey.exe - *BUILTIN-TOOL.AHK
pt_br: E:\Meu AutoHotkey.exe - *FERRAMENTA-NATIVA.AHK

source: E:\My Script.ahk - AutoHotkey v1.1.33.09
pt_br: E:\Meu Script.ahk - AutoHotkey v1.1.33.09

source: E:\My Script.exe
pt_br: E:\Meu Script.exe

source: Each character in the string is represented by a number, called its ordinal number, or character code.
pt_br: Cada caractere na string é representado por um número, chamado de número ordinal do caractere, ou código do caractere.

source: Each has their own special features.
pt_br: Cada uma delas tem suas características especiais.

source: Each message can optionally have one or more parameters (and, for Set, the value).
pt_br: Cada mensagem pode opcionalmente possuir um ou mais parâmetros, (e, para o caso de Set, o valor).

source: Each parameter is a value, such as a string or number.
pt_br: Cada parâmetro é um valor, como uma string ou um número.

source: Each string is actually a sequence or string of characters, but can be treated as a single entity.
pt_br: Cada string é na verdade uma sequência ou cadeia de caracteres, mas pode ser tratada como uma entidade única.

source: Each variable is not permanently restricted to a single data type, but can instead hold a value of any type:
pt_br: Cada variável não é permanentemente restrita a um tipo de dados, mas pode ter um valor de qualquer tipo:

source: Each variable starts off empty/blank; in other words, each newly created variable contains an empty string until it is assigned some other value.
pt_br: Cada variável começa vazia/em branco; em outras palavras, cada variável nova contém uma string vazia até que a ela seja atribuído um outro valor.

source: Easy.
pt_br: Fácil.

source: Edit Script
pt_br: Edit Script (Editar Script)

source: Edit This Script - See Edit.
pt_br: Edit This Script - Veja Edit (editar).

source: Edit a Script
pt_br: Editar um script

source: Embedded Scripts
pt_br: Scripts incorporados

source: Embedded Scripts [v1.1.34+]
pt_br: Scripts Incorporados [v1.1.34+]

source: Enable the Add 'Run with UI Access' to context menus option in AutoHotkey Setup.
pt_br: Habilite a opção Add 'Run with UI Access' to context menus na instalação do AutoHotkey.

source: Enjoy!
pt_br: Aproveite!

source: Ensure that at least one script is running that is using the keyboard hook.
pt_br: Certifique-se que pelo menos um script com o gancho de teclado esteja em execução.

source: Environment Variables
pt_br: Variáveis de Ambiente

source: Environment variables are maintained by the operating system.
pt_br: Variáveis de ambiente são mantidas pelo sistema operacional.

source: Equal signs (=) with a symbol in front of it such as := += -= .= etc. are called assignment operators and always require an expression.
pt_br: Sinais de igualdade (=) com um símbolo na frente deles, tais como := += -= .= etc. são chamados de operadores de atribuição e sempre requerem uma expressão.

source: Escape (or Esc)
pt_br: Escape (ou Esc)

source: Even a variable which is only assigned a value once can be useful.
pt_br: Mesmo uma variável à qual somente uma vez é atribuído um valor pode ser útil.

source: Everywhere in expressions.
pt_br: Em qualquer lugar dentro de expressões.

source: Example string:
pt_br: Exemplo de string:

source: Examples
pt_br: Exemplos

source: Execute
pt_br: Executar

source: Exit - Exit the script.
pt_br: Exit - Finaliza o script.

source: Expression mixed assignment
pt_br: Atribuição de expressão mista

source: Expression number assignment
pt_br: Atribuição de número como expressão

source: Expression text assignment
pt_br: Atribuição de texto como expressão

source: Expression variable assignment
pt_br: Atribuição de variável como expressão

source: External scripts and alternative embedded scripts can be executed by using the /script switch.
pt_br: Scripts externos e scripts alternativos incorporados podem ser executados usando-se o switch /script.

source: False positives might be more common for compiled scripts which have been compressed, such as with UPX (default for AutoHotkey 1.0 but not 1.1) or MPRESS (optional for AutoHotkey 1.1).
pt_br: Falsos positivos podem ser mais comuns para scripts compilados que foram comprimidos, como com UPX (padrão para AutoHotkey 1.0 mas não 1.1) ou MPRESS (opcional para AutoHotkey 1.1).

source: Favorites
pt_br: Favoritos

source: FileDelete, C:\My Temp File.txt
pt_br: FileDelete, C:\Meu Arquivo Temporario.txt

source: FileExist(VariableContainingPath)
pt_br: FileExist(VariavelContendoOCaminho)

source: FileRead, VarToContainContents, C:\My Temp File.txt
pt_br: FileRead, VariavelQueContemOConteudo, C:\Meu Arquivo Temporario.txt

source: Finally, AutoHotkey would not be what it is today without these other individuals.
pt_br: Finalmente, o AutoHotkey não seria o que é hoje se não fosse por estes outros indivíduos.

source: Finally, there are several built-in date/time variables, as well as the FormatTime command to create a custom date/time string.
pt_br: Finalmente, há várias variáveis de data/horário nativas, bem como o comando FormatTime para criar uma string de data/horário personalizada.

source: Find "New" in the menu.
pt_br: Encontre “Novo” no menu.

source: Find AutoHotkey in the list.
pt_br: Ache AutoHotkey na lista.

source: Find My Computer or Computer.
pt_br: Encontre Meu computador ou Computador.

source: Find the Start menu or Start Orb on your screen, usually in the lower left.
pt_br: Vá ao menu iniciar, normalmente no canto inferior esquerdo de sua tela.

source: Find the newly created file on your desktop and right-click it.
pt_br: Encontre o arquivo recém-criado em sua área de trabalho e clique com o botão direito nele.

source: Find the script file, select it, and press Ctrl+C.
pt_br: Encontre o arquivo do script, selecione-o e pressione Ctrl+C.

source: Finding your AHK version
pt_br: Determinando a versão de seu AHK
